#include <stdio.h>



int main() {

    // ข้อมูลผู้ใช้ 3 คน (ใส่ไว้ล่วงหน้า)

    char name1[] = "T"; // T = Title

    int age1 = 18; // อายุของตัวเอง

    int height1 = 156; // ส่วนสูงของตัวเอง

    float weight1 = 63; // น้ำหนักของตัวเอง

     char grade1 =  'A'; // A = 4.00 คือเกรด ดีเยี่ยม



    char name2[] = "W"; // W = Whale

    int age2 = 19; // อายุของตัวเอง

    int height2 = 170; // ส่วนสูงของตัวเอง

    float weight2 = 52.0; // น้ำหนักของตัวเอง

    char grade2 = 'B'; // B = 3.00 คือเกรด ดีมาก



    char name3[] = "P"; // P = Pee

    int age3 = 19; // อายุของตัวเอง

    int height3 = 175; // ส่วนสูงของตัวเอง

    float weight3 = 56.0; // น้ำหนักของตัวเอง

    char grade3 = 'C'; // C = 2.00 คือเกรด 



    // แสดงผลข้อมูลเป็นตาราง

    printf("\n-------------------------------------------------------------\n"); // เส้นแบ่งตาราง

    printf("| Name    | Age | Height(cm) | Weight(kg) |  Grade Point  |\n"); // หัวตาราง

    printf("-------------------------------------------------------------\n"); // เส้นแบ่งตาราง

    printf("| %-7s | %3d |     %3d     |    %5.1f   |     %c     |\n", name1, age1, height1, weight1, grade1); // แสดงข้อมูลคนแรก

    printf("| %-7s | %3d |     %3d     |    %5.1f   |     %c     |\n", name2, age2, height2, weight2, grade2); // แสดงข้อมูลคนที่สอง

    printf("| %-7s | %3d |     %3d     |    %5.1f   |     %c     |\n", name3, age3, height3, weight3, grade3); // แสดงข้อมูลคนที่สาม

    printf("-------------------------------------------------------------\n"); // เส้นแบ่งตาราง



    return 0; // จบโปรแกรมโดยส่งค่ากลับ 0 (แปลว่าโปรแกรมทำงานสำเร็จ)
}